backend/modules/posts/controllers/DefaultController.php

    public function actionIndex()
	{
        Yii::$app->view->title = 'Quản lý bài viết';

		$request = Yii::$app->request;

        $active = 3;

		$modelCategory = new \common\models\Category();
		$listCategory = $modelCategory->getListCategory();

		$query = Posts::find();
		if($request->Get('keyword'))
		{
			$query->where(['LIKE', 'title', $request->Get('keyword')]);
		}

		$pagination = new \yii\data\Pagination([
            'defaultPageSize' => Utility::$defaultPageSize,
            'totalCount' => $query->count()
        ]);

		$listAll = $query->offset($pagination->offset)
						->limit($pagination->limit)
						->all();
---
SELECT COUNT(*) FROM `tbl_posts`
SELECT * FROM `tbl_posts` LIMIT 10