backend/modules/posts/controllers/InputController.php

    public function loadModel($id = null)
    {
        $postModel = new Posts();
        $model = Posts::findOne($id);
---
SELECT * FROM `tbl_posts` WHERE `id` IS NULL