common/models/AdminUser.php

    public static function findIdentity($id)
    {
        return static::findOne([
                    'id' => $id,
//            'del_flg' => self::STATUS_ACTIVE
        ]);
---
SELECT * FROM `tbl_user` WHERE `id`=1

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `tbl_user` WHERE `username`='haanhdon'