html/frontend/modules/home/controllers/CategoryController.php

    public function actionIndex($rewrite){
        $model = \common\models\Category::findOne(['rewrite'=>$rewrite]);
---
SELECT * FROM `tbl_category` WHERE `rewrite`='windows'

	public function actionSubcate($rewrite){
        $model = \common\models\Category::findOne(['rewrite' => $rewrite, 'type' => 1]);
        if (!$model){
            throw new \yii\web\HttpException(404, 'The requested item could not be found.');
        }

		$this->infoConfig = ['keywords' => $model->keywords, 'description' => $model->description];

		$cateId = $model->id;
        $modelPost = new \common\models\Posts();

		$listSubCategory = $model->getListSubCategory($cateId);

        Yii::$app->view->title = $model->name.', Free download';

        $limit = 10;

		$listPost = $modelPost->getListBySubId($cateId);

		return $this->render('index', [
			'model' => $model,
			'listPost' => $listPost,
			'listChild' => $model->getListSubCategory($cateId, 2, true),
			'infoCate' => $model->findOne(['id' => $model->parent_id]),
---
SELECT * FROM `tbl_category` WHERE (`rewrite`='phan-mem-bao-mat') AND (`type`=1)
SELECT * FROM `tbl_category` WHERE `id`=4