html/frontend/modules/home/controllers/PostsController.php

    public function actionIndex($rewrite){
		$model = \common\models\Posts::findOne(['rewrite'=>$rewrite]);
        if (!$model){
            throw new \yii\web\HttpException(404, 'The requested item could not be found.');
        }

        $this->infoConfig = ['keywords' => $model->keywords, 'description' => $model->description];

        Yii::$app->view->title = 'Download '.$model->title;

        $modelPost = new \common\models\Posts();
		$modelCate = new \common\models\Category();

		$listComment = \common\models\Reviews::findAll(['post_id' => $model->id]);

		return $this->render('index', [
			'model' => $model,
			'infoCate' => $modelCate->findOne(['id' => $model->cate_id]),
			'subCate' => $modelCate->findOne(['id' => $model->sub_id]),
---
SELECT * FROM `tbl_posts` WHERE `rewrite`='free-download-manager'
SELECT * FROM `tbl_reviews` WHERE `post_id`='5'
SELECT * FROM `tbl_category` WHERE `id`=4
SELECT * FROM `tbl_category` WHERE `id`=16

	public function actionOption($rewrite){
		$model = \common\models\Posts::findOne(['rewrite'=>$rewrite]);
        if (!$model){
            throw new \yii\web\HttpException(404, 'The requested item could not be found.');
        }

        $this->infoConfig = ['keywords' => $model->keywords, 'description' => $model->description];

        Yii::$app->view->title = 'Download options '.$model->title;

        $modelPost = new \common\models\Posts();
		$modelCate = new \common\models\Category();

		return $this->render('option', [
			'model' => $model,
			'infoCate' => $modelCate->findOne(['id' => $model->cate_id]),
			'subCate' => $modelCate->findOne(['id' => $model->sub_id]),
---
SELECT * FROM `tbl_posts` WHERE `rewrite`='free-download-manager'
SELECT * FROM `tbl_category` WHERE `id`=4
SELECT * FROM `tbl_category` WHERE `id`=16