frontend/modules/home/controllers/CategoryController.php

    public function actionIndex($rewrite)
    {
        $model = \common\models\Category::findOne(['rewrite'=>$rewrite]);
---
SELECT * FROM `tbl_category` WHERE `rewrite`='hinh-anh'

	public function actionSubcate($slug, $rewrite)
    {
        $model = \common\models\Category::findOne(['rewrite' => $rewrite, 'type' => 1]);
        if(!$model){
            throw new \yii\web\HttpException(404, 'The requested item could not be found.');
        }

        $homePageCate = $model->findOne(['id' => $model->parent_id]);
---
SELECT * FROM `tbl_category` WHERE (`rewrite`='chat-video-call-sms') AND (`type`=1)
SELECT * FROM `tbl_category` WHERE `id`=4