frontend/modules/home/controllers/DefaultController.php

SELECT * FROM `tbl_posts` WHERE `id`='15'
---
    public function actionSearch()
    {
		$keyword = Yii::$app->request->Get('keyword');
		if($keyword == null){
			Yii::$app->response->redirect('/');
		}

        //set active menu on header
        $model = \common\models\Category::findOne(['id' => 4]);
        if(!$model){
            throw new \yii\web\HttpException(404, 'The requested item could not be found.');
		}

		$this->activeMenu = $model;

        $query = \common\models\Posts::find();