frontend/modules/home/controllers/PostsController.php

    public function actionIndex($rewrite)
	{
		$model = \common\models\Posts::findOne(['rewrite' => $rewrite]);
        if (!$model){
            throw new \yii\web\HttpException(404, 'The requested item could not be found.');
        }

		$modelPost = new \common\models\Posts();
		$modelCate = new \common\models\Category();

		//set active menu on header
		$homePageCate = \common\models\Category::findOne(['id' => $model->cate_id]);
		$this->activeMenu = $homePageCate;

        $this->infoConfig = ['keywords' => $model->keywords, 'description' => $model->description];

        Yii::$app->view->title = 'Download '.$model->title;

		$listComment = \common\models\Reviews::findAll(['post_id' => $model->id]);

		return $this->render('index', [
			'model' => $model,
			'infoCate' => $modelCate->findOne(['id' => $model->cate_id]),
			'subCate' => $modelCate->findOne(['id' => $model->sub_id]),
			'listPost' => $modelPost->getListPosts(),
			'listComment' => $listComment
		]);
---
SELECT * FROM `tbl_posts` WHERE `rewrite`='recuva'
SELECT * FROM `tbl_reviews` WHERE `post_id`=3
SELECT * FROM `tbl_category` WHERE `id`=20