backend/modules/category/controllers/DefaultController.php

SELECT COUNT(*) FROM `tbl_category`
SELECT * FROM `tbl_category` LIMIT 10 OFFSET 20
---
    public function actionIndex()
    {
        Yii::$app->view->title = 'Free download ｜ quản lý menu';

        $query = Category::find();

        $pagination = new \yii\data\Pagination([
            'defaultPageSize' => \common\components\Utility::$defaultPageSize,
            'totalCount' => $query->count()
        ]);

        $data['listAll'] = $query
                ->offset($pagination->offset)
                ->limit($pagination->limit)
                ->all();