backend/modules/category/controllers/InputController.php

SELECT * FROM `tbl_category` WHERE `id`='24'
---
    public function loadModel($id = null)
    {
        $cateModel = new Category();
        $model = Category::findOne($id);